# Задание 7.  Сумма элементов списка

# Дан список lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20].
# Выведите сумму всех элементов списка.

lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]
l = len(lst)
sum = 0

for i in range(0, l):
    sum += lst[i]

print(sum)