# Задание 1. Работа со списками

# Дан список lst = [ '🍇', '🍑', '🍐', '🍊', '🍌', '🍎'].
# Выведите на экран первый и последний элементы.

lst = [ '🍇', '🍑', '🍐', '🍊', '🍌', '🍎']
len_lst = len(lst)
print(lst[0], lst[len_lst - 1])
