# Задание 8. Range

# Изучите статью: https://pythonchik.ru/osnovy/python-range.
# Создайте список [ 18, 14, 10, 6, 2 ] с помощью функции range() и выведите его на экран.

for i in range(18, 0, -4):
    print(i, end = ' ')